'''
1. Створити функцію, яка аргументами прийматиме два списки, при цьому один з них
встановлений за замовчуванням (якщо його не передадуть в момент виклику), далі
ЗА ДОПОМОГО ЦИКЛУ створюємо словник, при цьому ключі отримуємо з одного списку,
значення- з іншого. Передбачається, що обидва списки містять лише незмінні типи
даних. В результаті- функція повертає новостворений словник.

2. Створити функцію, яка приймає два списки, та повертає словник, ключами якого
є кожен елемент першого списку, а значенням- весь другий список. Передбачається,
що в першому списку може знаходитись один set, якщо такий є- його потрібно видалити.
'''

def func1(lst1: list, lst2 = [6, 7, 8, 9 ,10]):
    dct1 = {i: j for i, j in zip(lst1, lst2)}
    return dct1
dct1 = func1([1, 2, 3, 4, 5])
print(dct1)

def func2(lst1: list, lst2: list):
    for element in lst1:
        if type(element) == set:
            lst1.remove(element)
    dct2 = {i: j for i, j in zip(lst1, lst2)}
    return dct2
dct2 = func2([1, 2, 3, 4, {'qwerty'}], [6, 7, 8, 9, 10])
print(dct2)
